# Ultralytics YOLO 🚀, AGPL-3.0 license
# HyUOD variant with adaptive background suppression + edge cues + local window attention

# Parameters
ch: 9
nc: 4
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Input_agent, []]
  - [0, 1, t_head, [64]]
  - [0, 1, A_head, [32]]
  - [0, 1, First_Conv, [64, 3, 2]]

  - [1, 1, t_block, [64]]
  - [2, 1, A_block, [64, 1]]
  - [-3, 1, Conv, [128, 3, 2]]
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [[-1, -4, -3], 1, Concat, [1]]
  - [-1, 1, frequent_block, [256, 0.25]]

  - [-6, 1, t_block, [128]]
  - [2, 1, A_block, [64, 2]]
  - [-3, 1, Conv, [256, 3, 2]]
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [[-1, -4, -3], 1, Concat, [1]]
  # Replaced one frequent_block with adaptive enhancement block (window=8, heads=4, e=0.5)
  - [-1, 1, AdaptiveEdgeWindowBlock, [512, 8, 4, 0.5]]

  - [-6, 1, t_block, [256]]
  - [2, 1, A_block, [64, 3]]
  - [-3, 1, Conv, [512, 3, 2]]
  - [-1, 2, C3k2, [512, True]]
  - [[-1, -4, -3], 1, Concat, [1]]
  - [-1, 1, frequent_block, [512]]

  - [-6, 1, t_block, [512]]
  - [2, 1, A_block, [64, 4]]
  - [-3, 1, Conv, [1024, 3, 2]]
  - [-1, 2, C3k2, [1024, True]]
  - [[-1, -4, -3], 1, Concat, [1]]
  - [-1, 1, frequent_block, [1024]]

  - [-1, 1, SPPF, [1024, 5]]
  - [-1, 2, C2PSA, [1024]]

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 21], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, False]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 15], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, False]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 32], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, False]]

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 29], 1, Concat, [1]]
  - [-1, 2, C3k2, [1024, True]]

  - [[35, 38, 41], 1, Detect, [nc]]

